package org.example.org.example.kotlincourse.lesson4

42 // это целое число, поэтому int
val myInt: Int = 42

98765432123456789L // большое целое число и в конце L, это long
val myLong: Long = 98765432123456789L

23.45f // в конце F, поэтому float + плавающая точка
val myFloat: Float = 23.45f

0.123456789 //число с плавающей точкой и без F, поэтому double
val myDouble: Double = 0.123456789

"Kotlin & Java" //текст в двойных ковычках, поэтому String
val text: String = "Kotlin & Java"

false //falce/true дает только boolean
val isKotlinFun: Boolean = false

'c' //одинокий символ в одиноких ковычках - признак чара => char
val letter: Char = 'c'

500 // это целое число, поэтому int
val myInt: Int = 500

4294967296L // большое целое число и в конце L, это long
val myLong: Long = 4294967296L

18.0f // в конце F, поэтому float + плавающая точка
val myFloat: Float = 18.0f

-0.001 //число с плавающей точкой и без F, поэтому double
val myDouble: Double = -0.001

"OpenAI" //текст в двойных ковычках, поэтому String
val text: String = "OpenAI"

“true” //falce/true дает только boolean, НО КОВЫЧКИ ДВОЙНЫЕ => String
val text: String = “true”

'9' //одинокий символ в одиноких ковычках - признак чара => char
val letter: Char = '9'

2048 // это целое число, поэтому int
val myInt: Int = 2048

10000000000L // большое целое число и в конце L, это long
val myLong: Long = 10000000000L

5.75f // в конце F, поэтому float + плавающая точка
val myFloat: Float = 5.75f

1.414 //число с плавающей точкой и без F, поэтому double
val myDouble: Double = 1.414

"Artificial Intelligence" //текст в двойных ковычках, поэтому String
val text: String = "Artificial Intelligence"

false //falce/true дает только boolean
val isKotlinFun: Boolean = false

'@' //одинокий символ в одиноких ковычках - признак чара => char
val letter: Char = '@'

1024 // это целое число, поэтому int
val myInt: Int = 1024

1234567890123L // большое целое число и в конце L, это long
val myLong: Long = 1234567890123L

10.01f // в конце F, поэтому float + плавающая точка
val myFloat: Float = 10.01f

-273.15 //число с плавающей точкой и без F, поэтому double
val myDouble: Double = -273.15

"SpaceX" //текст в двойных ковычках, поэтому String
val text: String =

true //falce/true дает только boolean
val isKotlinFun: Boolean = true

“🤯” //строка заключена в кавычки в стиле юникод, по идее это String
val text: String = “🤯”

‘65535’ //без поятия, давайте проверим интуицию и скажем, что это String из-за странных скобок
val text: String = ‘65535’

72057594037927935L // большое целое число и в конце L, это long
val myLong: Long = 72057594037927935L

2.71828f // в конце F, поэтому float + плавающая точка
val myFloat: Float = 2.71828f

101.0101 //число с плавающей точкой и без F, поэтому double
val myDouble: Double = 101.0101

"Quantum Computing" //текст в двойных ковычках, поэтому String
val text: String = "Quantum Computing"

false //falce/true дает только boolean
val isKotlinFun: Boolean = false

'x' //одинокий символ в одиноких ковычках - признак чара => char
val letter: Char = 'x'

314 // это целое число, поэтому int
val myInt: Int = 314

123456789123456789L // большое целое число и в конце L, это long
val myLong: Long = 123456789123456789L

6.626f // в конце F, поэтому float + плавающая точка
val myFloat: Float = 6.626f

0.007 //число с плавающей точкой и без F, поэтому double
val myDouble: Double = 0.007

"Android Studio" //текст в двойных ковычках, поэтому String
val text: String = "Android Studio"
