@file:Suppress("NAME_SHADOWING")

package org.example.kotlincourse.lesson7

                                               //Задания для Цикла for
//Прямой Диапазон:
//Напишите цикл for, который выводит числа от 1 до 5.
//fun main() {
//    //   for (i in 1..5) {
//println (i)
//}


//Напишите цикл for, который выводит четные числа от 1 до 10.
//   for (i in 1..10)
//       if (i % 2 == 0) {
//           println(i)
//       }
//
//
                                               //Обратный Диапазон:
//
//Создайте цикл for, который выводит числа от 5 до 1.
//for (i in 5 downTo 1) {
// println (i)
// }

//Создайте цикл for, который выводит числа от 10 до 1, уменьшая их на 2.
//for (i in 10 downTo 1) {
// println (i - 2)
// }

                                                  //С Шагом (step):
//
//Используйте цикл for с шагом 2 для вывода чисел от 1 до 9.
//    for (i in 1..9 step 2) {
//        println(i)
//    }

//Напишите цикл for, который выводит каждое третье число в диапазоне от 1 до 20.
//    for (i in 1..20 step 3) {
////        println(i)
////    }

                                             //Использование До (until):

//
//Используйте цикл for и until, чтобы вывести числа из диапазона 1-9 (9 не включается).
//for (i in 1 until 9) {
//    println(i)
//}

//Напишите цикл for с until, чтобы вывести числа от 3 до 15, не включая 15.
//for (i in 3 until 15) {
//println(i)
//    }
                                          //    Задания для Цикла while
//        Цикл while:
//
//        Создайте цикл while, который выводит квадраты чисел от 1 до 5.
//    var q = 1
//    while (q++ <= 5){
//        println(q * q)
//    }
//    Напишите цикл while, который уменьшает число от 10 до 5. После этого вывести результат в консоль
//       var q = 10
//       while (q-- > 5) {
//           println(q)
//       }



                                          //Цикл do...while:
//
//    Используйте цикл do...while, чтобы вывести числа от 5 до 1.
//     var q = 5
//     do {
//         println(q--)
//     }  while (q > 0)
//

//    Создайте цикл do...while, который повторяется, пока счетчик меньше 10, начиная с 5.
// var q = 5
//  do {
//    println(q++)
//
//}  while (q < 10)




                                          //Задания для Прерывания и Пропуска Итерации
                                          //Использование break:
//
//Напишите цикл for от 1 до 10 и используйте break, чтобы выйти из цикла при достижении 6.
//  var i = 1
//    for (i in 1..10) {
//     if (i == 6)break
//     println(i)
// }
// while (true) {
// if (i == 10)break
// println(i++)
// }

//Создайте цикл while, который бесконечно выводит числа, начиная с 1, но прерывается при достижении 10.

                                                   //Использование continue:
//
//В цикле for от 1 до 10 используйте continue, чтобы пропустить четные числа.
//   var q = 1
//   while (q < 10) {
//       if (q % 2 == 0){
//           q += 1; continue
//       }
//       println(q)
//       q+= 1
//   }
//  for (i in 1..10) {
//      if (i % 2 == 0)continue
//      println(i)
//  }

//Напишите цикл while, который выводит числа от 1 до 10, но пропускает числа, кратные 3.
//  var q = 1
//  while (q < 10){
//  if (q % 3 <= 0){
//      q+=1;continue
//  }
//      println(q)
//  }
fun main () {
    for (i in 1..10){
    for (q in 1..10) {
        print(i * q)
        print(" ")
    }
        println()
    }
}
